// BSLLS-off
// КаталогСправки задан как "C:\444\OneScriptTerminalGui\docs\OSTGui".
// КаталогБиблиотеки задан как "C:\444\111\OneScriptTerminalGui\OneScriptTerminalGui\bin\Debug".
Перем Ф, ИмяВременногоФайла, Таймер, ПолеВвода1, Форма1;
Перем СписокОшибок, КаталогСправки, КаталогБиблиотеки, КаталогТестов, ИмяЛогФайла, ХодВыполнения;
Перем Вин, СписокПроцессов, Кнопка1;

Функция СтрНайтиМежду(СтрПараметр, Фрагмент1 = Неопределено, Фрагмент2 = Неопределено, ИсключитьФрагменты = Истина, БезНаложения = Истина)
	//Стр - исходная строка
	//Фрагмент1 - подстрока поиска от которой ведем поиск
	//Фрагмент2 - подстрока поиска до которой ведем поиск
	//ИсключитьФрагменты - не включать Фрагмент1 и Фрагмент2 в результат
	//БезНаложения - в результат не будут включены участки, содержащие дугие найденные участки, удовлетворяющие переданным параметрам
	//функция возвращает массив строк
	Стр = СтрПараметр;
	М = Новый Массив;
	Если (Фрагмент1 <> Неопределено) и (Фрагмент2 = Неопределено) Тогда
		Позиция = Найти(Стр, Фрагмент1);
		Пока Позиция > 0 Цикл
			М.Добавить(?(ИсключитьФрагменты, Сред(Стр, Позиция + СтрДлина(Фрагмент1)), Сред(Стр, Позиция)));
			Стр = Сред(Стр, Позиция + 1);
			Позиция = Найти(Стр, Фрагмент1);
		КонецЦикла;
	ИначеЕсли (Фрагмент1 = Неопределено) и (Фрагмент2 <> Неопределено) Тогда
		Позиция = Найти(Стр, Фрагмент2);
		СуммаПозиций = Позиция;
		Пока Позиция > 0 Цикл
			М.Добавить(?(ИсключитьФрагменты, Сред(Стр, 1, СуммаПозиций - 1), Сред(Стр, 1, СуммаПозиций - 1 + СтрДлина(Фрагмент2))));
			Позиция = Найти(Сред(Стр, СуммаПозиций + 1), Фрагмент2);
			СуммаПозиций = СуммаПозиций + Позиция;
		КонецЦикла;
	ИначеЕсли (Фрагмент1 <> Неопределено) и (Фрагмент2 <> Неопределено) Тогда
		Позиция = Найти(Стр, Фрагмент1);
		Пока Позиция > 0 Цикл
			Стр2 = ?(ИсключитьФрагменты, Сред(Стр, Позиция + СтрДлина(Фрагмент1)), Сред(Стр, Позиция));
			Позиция2 = Найти(Стр2, Фрагмент2);
			СуммаПозиций2 = Позиция2;
			Пока Позиция2 > 0 Цикл
				Если БезНаложения Тогда
					Если Найти(Сред(Стр2, 1, СуммаПозиций2 - 1), Фрагмент2) = 0 Тогда
						М.Добавить("" + ?(ИсключитьФрагменты, Сред(Стр2, 1, СуммаПозиций2 - 1), Сред(Стр2, 1, СуммаПозиций2 - 1 + СтрДлина(Фрагмент2))));
					КонецЕсли;
				Иначе
					М.Добавить("" + ?(ИсключитьФрагменты, Сред(Стр2, 1, СуммаПозиций2 - 1), Сред(Стр2, 1, СуммаПозиций2 - 1 + СтрДлина(Фрагмент2))));
				КонецЕсли;
				Позиция2 = Найти(Сред(Стр2, СуммаПозиций2 + 1), Фрагмент2);
				СуммаПозиций2 = СуммаПозиций2 + Позиция2;
			КонецЦикла;
			Стр = Сред(Стр, Позиция + 1);
			Позиция = Найти(Стр, Фрагмент1);
		КонецЦикла;
	КонецЕсли;
	
	Возврат М;
КонецФункции

Процедура ТестированиеКодов()
	Массив0 = НайтиФайлы(КаталогСправки, "*.html", Истина);
	ВыбранныеФайлы = Новый Массив();
	МассивГолова = Новый Массив();
	МассивХвост = Новый Массив();
	Для А = 0 По Массив0.ВГраница() Цикл
		// Пропустить класс или поставить в конец списка.
		Если (СтрНайти(Массив0[А].ПолноеИмя, "MessageBoxInterval") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "xxxxxxxxxxxxxxxxxxxx") > 0)
			или (СтрНайти(Массив0[А].ПолноеИмя, "OneScriptTerminalGuiSendConsoleKey") > 0)
			
			
			
			Тогда // Этот не работает в линуксе и в линуксе пропустим.
			Если Вин Тогда
				МассивГолова.Добавить(Массив0[А]);
			Иначе
				Продолжить;
			КонецЕсли;
		ИначеЕсли 
			(СтрНайти(Массив0[А].ПолноеИмя, "ButtonMouseClickEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "ButtonMouseEnterEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "ButtonMouseLeaveEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "CheckBoxMouseEnterEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "CheckBoxMouseLeaveEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "ColorPickerMouseEnterEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "ColorPickerMouseLeaveEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "ColumnStyleCellsColorMethod") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "ContextMenuHideMethod") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "ContextMenuIsShowProperty") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "ContextMenuMouseFlagsProperty") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "ContextMenuPositionProperty") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "ContextMenuShowMethod") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "ContextMenuSubMenuProperty") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "ContextMenuUseSubMenusSingleFrameProperty") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "DateFieldMouseClickEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "DateFieldMouseEnterEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "DateFieldMouseLeaveEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "DialogMouseClickEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "EventArgsFlagsProperty") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "EventArgsSizeProperty") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "EventArgsTabProperty") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "EventArgsViewProperty") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "EventArgsXProperty") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "EventArgsYProperty") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "LabelClickedEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "LabelMouseClickEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "LabelMouseEnterEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "LabelMouseLeaveEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "MenuBarItemClickedEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "MenuBarMouseEnterEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "MenuBarMouseLeaveEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "MenuItemClickedEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "OneScriptTerminalGuiResizedEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "ProgressBarMouseClickEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "ProgressBarMouseEnterEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "ProgressBarMouseLeaveEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "RadioGroupMouseEnterEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "RadioGroupMouseLeaveEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "StatusBarMouseClickEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "StatusBarMouseEnterEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "StatusBarMouseLeaveEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "TabViewTabClickedEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "TableViewMouseClickEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "TableViewMouseEnterEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "TableViewMouseLeaveEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "TextFieldMouseClickEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "TextFieldMouseEnterEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "TextFieldMouseLeaveEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "TextViewMouseClickEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "TextViewMouseEnterEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "TextViewMouseLeaveEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "TimeFieldMouseClickEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "TimeFieldMouseEnterEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "TimeFieldMouseLeaveEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "ToplevelMouseClickEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "ToplevelMouseEnterEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "ToplevelMouseLeaveEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "TreeViewEnsureVisibleMethod") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "TreeViewMouseClickEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "TreeViewMouseEnterEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "TreeViewMouseLeaveEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "TreeViewScrollDownMethod") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "TreeViewScrollUpMethod") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "WindowMouseClickEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "WindowMouseEnterEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "WindowMouseLeaveEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "OneScriptTerminalGuiOpenDialog") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "CheckBoxToggled") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "EventArgsDialogResultProperty") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "EventArgsDirectoryPathProperty") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "EventArgsFilePathProperty") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "EventArgsFilePathsProperty") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "OneScriptTerminalGuiOpenDialogMethod") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "OneScriptTerminalGuiSaveDialogMethod") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "OpenDialogConstructor") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "OpenDialogDialogClosedEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "SaveDialogConstructor") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "SaveDialogDialogClosedEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "ComboBoxKeyPress") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "ComboBoxOpenSelectedItem") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "ComboBoxEnter") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "DateFieldKeyPress") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "TableViewCellActivated") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "TableViewNativeCellActivated") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "ContextMenuIsShow") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "ContextMenuShow") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "OneScriptTerminalGuiWinPlatformProperty") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "EventArgsOldToggledProperty") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "ListViewOpenSelectedItemEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "ContextMenuConstructor") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "TableViewNativeCellActivated") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "EventArgsCancel") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "OneScriptTerminalGuiContextMenuMethod") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "AddShortcut") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "GetShortcut") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "ShortcutAction") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "RemoveShortcut") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "DialogLeave") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "EventArgsMenuItemProperty") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "EventArgsNewNodeProperty") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "EventArgsNewTextProperty") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "EventArgsOldNodeProperty") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "EventArgsOldTextProperty") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "EventArgsTreeViewProperty") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "EventArgsValueProperty") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "ListViewLeaveEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "ListViewSelectedItemChangedEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "MenuBarMenuOpenedEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "MenuBarMenuAllClosedEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "OpenDialogLeaveEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "MessageBoxShowMethod") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "SaveDialogLeaveEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "TabViewEnterEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "TabViewLeaveEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "TextFieldTextChangedEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "TextFieldTextChangingEvent") > 0) 
			или (СтрНайти(Массив0[А].ПолноеИмя, "TreeViewSelectionChangedEvent") > 0) 
			
			
			
			
			
			
			
			
			
			
			
			
			
			
			Тогда // Этот интерактивный и будет тестироваться в конце.
			МассивХвост.Добавить(Массив0[А]);
		Иначе
			// // // // // МассивГолова.Добавить(Массив0[А]);
		КонецЕсли;
	КонецЦикла;
	Для А = 0 По МассивГолова.ВГраница() Цикл
		ВыбранныеФайлы.Добавить(МассивГолова[А]);
	КонецЦикла;
	// Если без интерактивных.
	Для А = 0 По МассивХвост.ВГраница() Цикл
		ВыбранныеФайлы.Добавить(МассивХвост[А]);
	КонецЦикла;
	
	Для А = 0 По ВыбранныеФайлы.ВГраница() Цикл // ВыбранныеФайлы.ВГраница()
		Сообщить(" (" + Ф.Математика().Окр(((ТекущаяУниверсальнаяДатаВМиллисекундах() - Таймер)/1000)/60, 2) + " мин." + " " + А + " из " + 
		ВыбранныеФайлы.ВГраница() + ") " + ВыбранныеФайлы[А].ПолноеИмя);
		
		// // Пропустить файлы. Сначала сбойные заносим сюда.
		// Если (СтрНайти(ВыбранныеФайлы[А].ПолноеИмя, "йййййй") > 0) 
			// или (СтрНайти(ВыбранныеФайлы[А].ПолноеИмя, "йййййй") > 0) 
			// или (СтрНайти(ВыбранныеФайлы[А].ПолноеИмя, "йййййй") > 0) 
			// или (СтрНайти(ВыбранныеФайлы[А].ПолноеИмя, "йййййй") > 0) 
			// или (СтрНайти(ВыбранныеФайлы[А].ПолноеИмя, "TreeViewSelectionChangedEvent") > 0) 
			// или (СтрНайти(ВыбранныеФайлы[А].ПолноеИмя, "TextFieldTextChangingEvent") > 0) 
			// или (СтрНайти(ВыбранныеФайлы[А].ПолноеИмя, "TextFieldTextChangedEvent") > 0) 
			// или (СтрНайти(ВыбранныеФайлы[А].ПолноеИмя, "ListViewSelectedItemChangedEvent") > 0) 
			// или (СтрНайти(ВыбранныеФайлы[А].ПолноеИмя, "EventArgsValueProperty") > 0) 
			// или (СтрНайти(ВыбранныеФайлы[А].ПолноеИмя, "EventArgsTreeViewProperty") > 0) 
			// или (СтрНайти(ВыбранныеФайлы[А].ПолноеИмя, "EventArgsOldTextProperty") > 0) 
			// или (СтрНайти(ВыбранныеФайлы[А].ПолноеИмя, "EventArgsOldNodeProperty") > 0) 
			// или (СтрНайти(ВыбранныеФайлы[А].ПолноеИмя, "EventArgsNewTextProperty") > 0) 
			// или (СтрНайти(ВыбранныеФайлы[А].ПолноеИмя, "EventArgsNewNode") > 0) 
			// или (СтрНайти(ВыбранныеФайлы[А].ПолноеИмя, "ComboBoxSelectedItemChanged") > 0) 
			// Тогда
			// Продолжить;
		// КонецЕсли;
		
		// // Только эти файлы. Потом эти сбойные проверяем отдельно.
		// Если (СтрНайти(ВыбранныеФайлы[А].ПолноеИмя, "йййййй") > 0) 
			// или (СтрНайти(ВыбранныеФайлы[А].ПолноеИмя, "йййййй") > 0) 
			// или (СтрНайти(ВыбранныеФайлы[А].ПолноеИмя, "йййййй") > 0) 
			// или (СтрНайти(ВыбранныеФайлы[А].ПолноеИмя, "OpenDialogDialogClosed") > 0) 
			// // или (СтрНайти(ВыбранныеФайлы[А].ПолноеИмя, "TreeViewSelectionChangedEvent") > 0) 
			// // или (СтрНайти(ВыбранныеФайлы[А].ПолноеИмя, "TextFieldTextChangingEvent") > 0) 
			// // или (СтрНайти(ВыбранныеФайлы[А].ПолноеИмя, "TextFieldTextChangedEvent") > 0) 
			// // или (СтрНайти(ВыбранныеФайлы[А].ПолноеИмя, "ListViewSelectedItemChangedEvent") > 0) 
			// // или (СтрНайти(ВыбранныеФайлы[А].ПолноеИмя, "EventArgsValueProperty") > 0) 
			// // или (СтрНайти(ВыбранныеФайлы[А].ПолноеИмя, "EventArgsTreeViewProperty") > 0) 
			// // или (СтрНайти(ВыбранныеФайлы[А].ПолноеИмя, "EventArgsOldTextProperty") > 0) 
			// // или (СтрНайти(ВыбранныеФайлы[А].ПолноеИмя, "EventArgsOldNodeProperty") > 0) 
			// // или (СтрНайти(ВыбранныеФайлы[А].ПолноеИмя, "EventArgsNewTextProperty") > 0) 
			// // или (СтрНайти(ВыбранныеФайлы[А].ПолноеИмя, "EventArgsNewNode") > 0) 
			// // или (СтрНайти(ВыбранныеФайлы[А].ПолноеИмя, "ComboBoxSelectedItemChanged") > 0) 
			// Тогда
		// Иначе
			// Продолжить;
		// КонецЕсли;

		ТекстДок = Новый ТекстовыйДокумент;
		ТекстДок.Прочитать(ВыбранныеФайлы[А].ПолноеИмя);
		Стр = ТекстДок.ПолучитьТекст();
		
		Заголовок = "";
		М0 = СтрНайтиМежду(Стр, "<h1 class=dtH1>", "</h1>", , );
		Если М0.Количество() > 0 Тогда
			Заголовок = СтрЗаменить(М0[0], "&nbsp;", " ");
		КонецЕсли;
		
		М = СтрНайтиМежду(Стр, "<summary>Тестовый код</summary>", "</pre>", Ложь, );
		Если М.Количество() > 0 Тогда
			Для А2 = 0 По М.Количество() - 1 Цикл
				ТестовыйКод = СтрНайтиМежду(М[А2], "<div id=""cont2"">", "</div>", Ложь, )[0];
				ТестовыйКод = СтрНайтиМежду(ТестовыйКод, """>", "</div>", , )[0];
				
				// Чтобы параллельные тесты не мешали друг другу пусть пишут каждый в свой файл.
				ФайлРезультата = СтрЗаменить("" + Ф.Математика().Случайное(), "0.", "");
				ФайлРезультата = СтрЗаменить(ФайлРезультата, "0,", "");
				ФайлРезультата = ФайлРезультата + ".tmp";
				
				Если Не (СокрЛП(ТестовыйКод) = "") Тогда
					// Заменим Сообщить на ТФ.ДобавитьВесьТекст
					ПодстрокаПоиска = "Сообщить(?(";
					Если Вин Тогда
						ПодстрокаЗамены = "ТФ.ДобавитьВесьТекст(Новый Файл(ТекущийСценарий().Источник).Путь + ""\" + ФайлРезультата + """, (?(";
					Иначе
						ПодстрокаЗамены = "ТФ.ДобавитьВесьТекст(Новый Файл(ТекущийСценарий().Источник).Путь + ""/" + ФайлРезультата + """, (?(";
					КонецЕсли;
					ТестовыйКод = СтрЗаменить(ТестовыйКод, ПодстрокаПоиска, ПодстрокаЗамены);
					
					ПодстрокаПоиска = """ + "" "" + ТекущаяДата() + Символы.ПС);";
					ПодстрокаЗамены = """ + "" "" + ТекущаяДата() + Символы.ПС));";
					ТестовыйКод = СтрЗаменить(ТестовыйКод, ПодстрокаПоиска, ПодстрокаЗамены);
					
					// Добавим учет ошибок тестового кода из за синтаксиса и других случаев.
					Голова = "Попытка
						|
						|";
						
					Если Вин Тогда
						Хвост = "
							|Исключение
							|	ИнформацияОбОшибке1 = ИнформацияОбОшибке();
							|	Ошибка = ""{" + Заголовок + " Модуль "" + ИнформацияОбОшибке1.ИмяМодуля + "" / Ошибка в строке: "" + ИнформацияОбОшибке1.НомерСтроки  + "" / "" + ИнформацияОбОшибке1.Описание + ""}"";
							|	ТФ.ДобавитьВесьТекст(Новый Файл(ТекущийСценарий().Источник).Путь + ""\" + ФайлРезультата + """, Ошибка + Символы.ПС);
							|КонецПопытки;
							|";
					Иначе
						Хвост = "
							|Исключение
							|	ИнформацияОбОшибке1 = ИнформацияОбОшибке();
							|	Ошибка = ""{" + Заголовок + " Модуль "" + ИнформацияОбОшибке1.ИмяМодуля + "" / Ошибка в строке: "" + ИнформацияОбОшибке1.НомерСтроки  + "" / "" + ИнформацияОбОшибке1.Описание + ""}"";
							|	ТФ.ДобавитьВесьТекст(Новый Файл(ТекущийСценарий().Источник).Путь + ""/" + ФайлРезультата + """, Ошибка + Символы.ПС);
							|КонецПопытки;
							|";
					КонецЕсли;
					
					ПодстрокаПоиска = "ПодключитьВнешнююКомпоненту";
					ПодстрокаЗамены = Голова + "
					|
					|
					|ПодключитьВнешнююКомпоненту";
					ТестовыйКод = СтрЗаменить(ТестовыйКод, ПодстрокаПоиска, ПодстрокаЗамены);
						
					ТестовыйКод = ТестовыйКод + Хвост;
					
					// Перенаправим критические ошибки во временный файл.
					ПодстрокаПоиска = "ТФ = Новый ТерминалФормыДляОдноСкрипта();";
					ПодстрокаЗамены = "ТФ = Новый ТерминалФормыДляОдноСкрипта();
					|ТекПуть = Новый Файл(ТекущийСценарий().Источник).Путь;
					|ТФ.РежимТестирования = Истина;
					|ТФ.ЛогФайл = ОбъединитьПути(ТекПуть, ""999642391688955.tmp"");";
					ТестовыйКод = СтрЗаменить(ТестовыйКод, ПодстрокаПоиска, ПодстрокаЗамены);
					
					Если Не Вин Тогда
						ПодстрокаПоиска = "ПодключитьВнешнююКомпоненту(""C:\444\111\OneScriptTerminalGui\OneScriptTerminalGui\bin\Debug\";
						ПодстрокаЗамены = "ПодключитьВнешнююКомпоненту(""/home/vlad/Projects/444/111/OneScriptTerminalGui/OneScriptTerminalGui/bin/Debug/";
						ТестовыйКод = СтрЗаменить(ТестовыйКод, ПодстрокаПоиска, ПодстрокаЗамены);
					КонецЕсли;
					
					ТекстДокХХХ = Новый ТекстовыйДокумент;
					
					ИмяВременногоФайла = КаталогТестов + СтрЗаменить(ВыбранныеФайлы[А].Имя, ".html", "") + "-код.os";
					ИмяВременногоФайла = СтрЗаменить(ИмяВременногоФайла, "OSTGui.", "");
					ТекстДокХХХ.Записать(ИмяВременногоФайла, "UTF-8");
					
					ТекстДок = Новый ТекстовыйДокумент;
					ТекстДок.Прочитать(ХодВыполнения, "UTF-8");
					СтрЛог = ТекстДок.ПолучитьТекст();
					СтрЛог = СтрЛог + "" + А + " из " + ВыбранныеФайлы.ВГраница() + " " + Заголовок + " {" + ИмяВременногоФайла + "}";
					ТекстДок.УстановитьТекст(СтрЛог);
					ТекстДок.Записать(ХодВыполнения);
					
					ТекстДокХХХ.Прочитать(ИмяВременногоФайла);
					ТекстДокХХХ.УстановитьТекст(ТестовыйКод);
					ТекстДокХХХ.Записать(ИмяВременногоФайла, "UTF-8");
					Форма1.Фокус();
					// Ф.ПередатьУправление();
					
					Пока ПроверитьКоличествоНезавершенных() > 5 Цикл
						Приостановить(1000);
					КонецЦикла;
					
					Если Вин Тогда
						Команда1("""C:\Program Files\OneScript\bin\oscript.exe""", ИмяВременногоФайла);
					Иначе
						// Параметры запуска терминала и команды
						terminal = "mate-terminal";  // или "konsole", "xterm", "mate-terminal", "gnome-terminal" и т. п.
						command = "oscript";
						arguments = """ -- """ + ИмяВременногоФайла;

						Если (terminal = "gnome-terminal") Тогда
							arguments = " -- " + command + " " + ИмяВременногоФайла;
						ИначеЕсли (terminal = "konsole") Тогда
							arguments = " -e " + command + " " + ИмяВременногоФайла;
						ИначеЕсли (terminal = "xterm") Тогда
							arguments = " -e " + command + " " + ИмяВременногоФайла;
						ИначеЕсли (terminal = "mate-terminal") Тогда
							arguments = " -- " + command + " " + ИмяВременногоФайла;
						Иначе
							Сообщить("Неподдерживаемый терминал: " + terminal);
						КонецЕсли;

						Попытка
							Команда1(terminal, arguments);
						Исключение
							Сообщить("Ошибка запуска: " + ИмяВременногоФайла);
						КонецПопытки;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры//ТестированиеКодов

Функция ПроверитьКоличествоНезавершенных()
	// ВАЖНО: При тестировании интерактивных.
	// Если консоль пришла в ступор и только крестиком остается её закрыть, то *.tmp не будет создан 
	// программно и счетчик разрешенных одновременных запусков уменьшится на 1.
	// Чтобы вернуть счетчик к прежнему значению, нужно создать *.tmp файл с любым именем вручную в .../ТестыTUI/
	КолНезавершенных = 0;
	Если Вин Тогда
		Для А67 = 0 По СписокПроцессов.Количество() - 1 Цикл
			Проц = СписокПроцессов.Получить(А67).Значение;
			Если Не Проц.Завершен Тогда
				КолНезавершенных = КолНезавершенных + 1;
			КонецЕсли;
		КонецЦикла;
	Иначе
		НаПроверку = НайтиФайлы(КаталогТестов, "*.os", Истина);
		Проверенные = НайтиФайлы(КаталогТестов, "*.tmp", Истина);
		КолНезавершенных = НаПроверку.Количество() - Проверенные.Количество();
	КонецЕсли;
	Возврат КолНезавершенных;
КонецФункции

Функция Команда1(ИмяФайла, Аргументы)
	ИнформацияЗапускаПроцесса1 = Ф.ИнформацияЗапускаПроцесса();
	ИнформацияЗапускаПроцесса1.ИмяФайла = ИмяФайла;
	ИнформацияЗапускаПроцесса1.Аргументы = Аргументы;

	Процесс1 = Ф.Процесс();
	СписокПроцессов.Добавить(Процесс1);
	Процесс1.НачальнаяИнформация = ИнформацияЗапускаПроцесса1;
	Процесс1.Начать();
	Ф.ПередатьУправление();
КонецФункции//Команда1

Процедура АнализЛогФайла()
	// Все результаты у нас пока записаны в файлы *.tmp
	// Прочитаем их.
	Временные = НайтиФайлы(КаталогТестов, "*.tmp", Истина);
	СписокВременные = Новый СписокЗначений();
	Для А = 0 По Временные.ВГраница() Цикл
		ТекстДок = Новый ТекстовыйДокумент;
		ТекстДок.Прочитать(Временные[А].ПолноеИмя, "UTF-8");
		СписокВременные.Добавить(ТекстДок.ПолучитьТекст());
	КонецЦикла;
	
	СписокВременные.СортироватьПоЗначению();
	СтрИзВременных = "";
	Для А = 0 По СписокВременные.Количество() - 1 Цикл
		СтрИзВременных = СтрИзВременных + СписокВременные.Получить(А).Значение;
	КонецЦикла;
	
	ТекстДок = Новый ТекстовыйДокумент;
	ТекстДок.УстановитьТекст(СтрИзВременных);
	ТекстДок.Записать(ИмяЛогФайла);
	
	КаталогНаДиске = Новый Файл(ИмяЛогФайла);
    Если Не (КаталогНаДиске.Существует()) Тогда
		Возврат;
	КонецЕсли;
	ТекстДок = Новый ТекстовыйДокумент;
	ТекстДок.Прочитать(ИмяЛогФайла, "UTF-8");
	Стр = ТекстДок.ПолучитьТекст();
	КолСтрок = СтрЧислоСтрок(Стр);
	Для А = 1 По КолСтрок Цикл
		ТекСтрока = СтрПолучитьСтроку(Стр, А);
		Если (СтрНайти(ТекСтрока, "!!!") > 0) или (СтрНайти(ТекСтрока, "{") > 0) Тогда
			СписокОшибок.Добавить(ТекСтрока);
		КонецЕсли;
	КонецЦикла;
	// Ф.ПередатьУправление();
КонецПроцедуры//АнализЛогФайла

Функция Кнопка1_Нажатие() Экспорт
	АнализЛогФайла();

	ПолеВвода1.ДобавитьТекст("================" + Символы.ПС);
	ПолеВвода1.ДобавитьТекст("Тест выполнен за: " + ((ТекущаяУниверсальнаяДатаВМиллисекундах()-Таймер)/1000)/60 + " мин." + " " + ТекущаяДата() + Символы.ПС);
	ПолеВвода1.ДобавитьТекст("Ошибок = " + СписокОшибок.Количество() + Символы.ПС);
	Для А = 0 По СписокОшибок.Количество() - 1 Цикл
		ПолеВвода1.ДобавитьТекст("" + СписокОшибок.Получить(А).Значение + Символы.ПС);
		ПолеВвода1.НачалоВыделения = ПолеВвода1.ДлинаТекста;
		ПолеВвода1.ПрокрутитьДоКурсора();
	КонецЦикла;
	
	Кнопка1.НаЗаднийПлан();
КонецФункции

Таймер = ТекущаяУниверсальнаяДатаВМиллисекундах();

СписокПроцессов = Новый СписокЗначений();

Если СтрНайти((Новый СистемнаяИнформация()).ВерсияОС, "Windows") > 0 Тогда
	Вин = Истина;
Иначе
	Вин = Ложь;
КонецЕсли;
Если Вин Тогда
	КаталогСправки = "C:\444\OneScriptTerminalGui\docs\OSTGui";// без слэша в конце
	КаталогБиблиотеки = "C:\444\111\OneScriptTerminalGui\OneScriptTerminalGui\bin\Debug";// без слэша в конце
	ПутьБиблиотекиФорм = "C:\444\111\OneScriptForms\OneScriptForms\bin\Debug\OneScriptForms.dll";// без слэша в конце
	КаталогТестов = "C:\444\ТестыTUI\"; // со слэшем в конце
	ИмяЛогФайла = "C:\444\ТестыTUI\LogTUI.txt";
	ХодВыполнения = "C:\444\ТестыTUI\CurrentTUI.txt";
	ПодключитьВнешнююКомпоненту(КаталогБиблиотеки + "\OneScriptTerminalGui.dll");
Иначе
	КаталогСправки = "/home/vlad/Projects/444/OneScriptTerminalGui/docs/OSTGui";// без слэша
	КаталогБиблиотеки = "/home/vlad/Projects/444/111/OneScriptTerminalGui/OneScriptTerminalGui/bin/Debug";// без слэша
	ПутьБиблиотекиФорм = "/home/vlad/Projects/444/111/OneScriptForms/OneScriptForms/bin/Debug/OneScriptForms.dll";// без слэша в конце
	КаталогТестов = "/home/vlad/Projects/444/ТестыTUI/"; // со слэшем в конце
	ИмяЛогФайла = "/home/vlad/Projects/444/ТестыTUI/LogTUI.txt";
	ХодВыполнения = "/home/vlad/Projects/444/ТестыTUI/CurrentTUI.txt";
	ПодключитьВнешнююКомпоненту(КаталогБиблиотеки + "/OneScriptTerminalGui.dll");
КонецЕсли;
ПодключитьВнешнююКомпоненту(ПутьБиблиотекиФорм);
// // // // // ПодключитьВнешнююКомпоненту("C:\444\111\OneScriptForms\OneScriptForms\bin\Debug\OneScriptForms.dll");
Ф = Новый ФормыДляОдноСкрипта();

Если Вин Тогда
	УдалитьФайлы(КаталогТестов, "*.tmp");
	УдалитьФайлы(КаталогТестов, "*.os");
	УдалитьФайлы(ИмяЛогФайла);
	УдалитьФайлы(ХодВыполнения);
Иначе
	// УдалитьФайлы("/home/vlad/Projects/444/ТестыTUI", "*.os");
	УдалитьФайлы(КаталогТестов, "*.tmp");
	УдалитьФайлы(КаталогТестов, "*.os");
	УдалитьФайлы(ИмяЛогФайла);
	УдалитьФайлы(ХодВыполнения);
КонецЕсли;

ТекстДок = Новый ТекстовыйДокумент;
ТекстДок.УстановитьТекст("");
ТекстДок.Записать(ИмяЛогФайла);

ТекстДок = Новый ТекстовыйДокумент;
ТекстДок.УстановитьТекст("");
ТекстДок.Записать(ХодВыполнения);

Форма1 = Ф.Форма();
Форма1.Текст = "Общий тест OneScriptTerminalGui.dll";
Форма1.Ширина = 1100;
Форма1.Высота = 600;
Форма1.Отображать = Истина;
Форма1.Показать();

ПолеВвода1 = Форма1.ЭлементыУправления.Добавить(Ф.ПолеВвода());
ПолеВвода1.МногострочныйРежим = Истина;
ПолеВвода1.Стыковка = Ф.СтильСтыковки.Заполнение;
ПолеВвода1.ЦветФона = Ф.Цвет().Черный;
ПолеВвода1.ОсновнойЦвет = Ф.Цвет().БледноЗеленый;
ПолеВвода1.ПолосыПрокрутки = Ф.ПолосыПрокрутки.Обе;
ПолеВвода1.ПринятиеВозврат = Истина;
ПолеВвода1.Перенос = Ложь;
ПолеВвода1.РегистрСимволов = Ф.РегистрСимволов.Стандартный;

СписокОшибок = Новый СписокЗначений;

ТестированиеКодов();

Кнопка1 = Форма1.ЭлементыУправления.Добавить(Ф.Кнопка());
Кнопка1.Нажатие = Ф.Действие(ЭтотОбъект, "Кнопка1_Нажатие");
Кнопка1.Текст = "Вывести результат";
Кнопка1.Ширина = 120;
Кнопка1.Центр();
Кнопка1.НаПереднийПлан();

Ф.ЗапуститьОбработкуСобытий();