// BSLLS-off
// КаталогСправки задан как "C:\444\OneScriptTerminalGui\docs\OSTGui".
// КаталогБиблиотеки задан как "C:\444\111\OneScriptTerminalGui\OneScriptTerminalGui\bin\Debug".
Перем Ф, ИмяВременногоФайла, Таймер, ПолеВвода1, Форма1;
Перем СписокОшибок, КаталогСправки, КаталогБиблиотеки, КаталогТестов, ИмяЛогФайла;

Функция СтрНайтиМежду(СтрПараметр, Фрагмент1 = Неопределено, Фрагмент2 = Неопределено, ИсключитьФрагменты = Истина, БезНаложения = Истина)
	//Стр - исходная строка
	//Фрагмент1 - подстрока поиска от которой ведем поиск
	//Фрагмент2 - подстрока поиска до которой ведем поиск
	//ИсключитьФрагменты - не включать Фрагмент1 и Фрагмент2 в результат
	//БезНаложения - в результат не будут включены участки, содержащие дугие найденные участки, удовлетворяющие переданным параметрам
	//функция возвращает массив строк
	Стр = СтрПараметр;
	М = Новый Массив;
	Если (Фрагмент1 <> Неопределено) и (Фрагмент2 = Неопределено) Тогда
		Позиция = Найти(Стр, Фрагмент1);
		Пока Позиция > 0 Цикл
			М.Добавить(?(ИсключитьФрагменты, Сред(Стр, Позиция + СтрДлина(Фрагмент1)), Сред(Стр, Позиция)));
			Стр = Сред(Стр, Позиция + 1);
			Позиция = Найти(Стр, Фрагмент1);
		КонецЦикла;
	ИначеЕсли (Фрагмент1 = Неопределено) и (Фрагмент2 <> Неопределено) Тогда
		Позиция = Найти(Стр, Фрагмент2);
		СуммаПозиций = Позиция;
		Пока Позиция > 0 Цикл
			М.Добавить(?(ИсключитьФрагменты, Сред(Стр, 1, СуммаПозиций - 1), Сред(Стр, 1, СуммаПозиций - 1 + СтрДлина(Фрагмент2))));
			Позиция = Найти(Сред(Стр, СуммаПозиций + 1), Фрагмент2);
			СуммаПозиций = СуммаПозиций + Позиция;
		КонецЦикла;
	ИначеЕсли (Фрагмент1 <> Неопределено) и (Фрагмент2 <> Неопределено) Тогда
		Позиция = Найти(Стр, Фрагмент1);
		Пока Позиция > 0 Цикл
			Стр2 = ?(ИсключитьФрагменты, Сред(Стр, Позиция + СтрДлина(Фрагмент1)), Сред(Стр, Позиция));
			Позиция2 = Найти(Стр2, Фрагмент2);
			СуммаПозиций2 = Позиция2;
			Пока Позиция2 > 0 Цикл
				Если БезНаложения Тогда
					Если Найти(Сред(Стр2, 1, СуммаПозиций2 - 1), Фрагмент2) = 0 Тогда
						М.Добавить("" + ?(ИсключитьФрагменты, Сред(Стр2, 1, СуммаПозиций2 - 1), Сред(Стр2, 1, СуммаПозиций2 - 1 + СтрДлина(Фрагмент2))));
					КонецЕсли;
				Иначе
					М.Добавить("" + ?(ИсключитьФрагменты, Сред(Стр2, 1, СуммаПозиций2 - 1), Сред(Стр2, 1, СуммаПозиций2 - 1 + СтрДлина(Фрагмент2))));
				КонецЕсли;
				Позиция2 = Найти(Сред(Стр2, СуммаПозиций2 + 1), Фрагмент2);
				СуммаПозиций2 = СуммаПозиций2 + Позиция2;
			КонецЦикла;
			Стр = Сред(Стр, Позиция + 1);
			Позиция = Найти(Стр, Фрагмент1);
		КонецЦикла;
	КонецЕсли;
	
	Возврат М;
КонецФункции

Процедура ТестированиеКодов()
	Если Ф.ПлатформаWin Тогда
		ВыбранныеФайлы = НайтиФайлы(КаталогСправки, "*.html", Истина);
	Иначе
		// ВыбранныеФайлы = НайтиФайлы(КаталогСправки + "/OneScriptFormsru", "*.html", Истина);
	КонецЕсли;
	Для А = 0 По ВыбранныеФайлы.ВГраница() Цикл
		Сообщить(" (" + Ф.Математика().Окр(((ТекущаяУниверсальнаяДатаВМиллисекундах() - Таймер)/1000)/60, 2) + " мин." + " " + А + " из " + 
		ВыбранныеФайлы.ВГраница() + ") " + ВыбранныеФайлы[А].ПолноеИмя);
		
		// // Избирательно для этого класса
		// Если Не (СтрНайти(ВыбранныеФайлы[А].ПолноеИмя, "CircularProgressBar") > 0) Тогда
			// Продолжить;
		// КонецЕсли;

		ТекстДок = Новый ТекстовыйДокумент;
		ТекстДок.Прочитать(ВыбранныеФайлы[А].ПолноеИмя);
		Стр = ТекстДок.ПолучитьТекст();
		
		Заголовок = "";
		М0 = СтрНайтиМежду(Стр, "<H1 class=dtH1>", "</H1>", , );
		Если М0.Количество() > 0 Тогда
			Заголовок = СтрЗаменить(М0[0], "&nbsp;", " ");
		КонецЕсли;
		
		М = СтрНайтиМежду(Стр, "<summary>Тестовый код</summary>", "</PRE>", Ложь, );
		Если М.Количество() > 0 Тогда
			Для А2 = 0 По М.Количество() - 1 Цикл
				ТестовыйКод = СтрНайтиМежду(М[А2], "<DIV id=""cont2"">", "</DIV>", Ложь, )[0];
				ТестовыйКод = СтрНайтиМежду(ТестовыйКод, """>", "</DIV>", , )[0];
				
				Если Не (СокрЛП(ТестовыйКод) = "") Тогда
					// Заменим Сообщить на ТФ.ДобавитьВесьТекст
					ПодстрокаПоиска = "Сообщить(?(";
					ПодстрокаЗамены = "ТФ.ДобавитьВесьТекст(Новый Файл(ТекущийСценарий().Источник).Путь + ""\LogTUI.txt"", (?(";
					ТестовыйКод = СтрЗаменить(ТестовыйКод, ПодстрокаПоиска, ПодстрокаЗамены);
					
					ПодстрокаПоиска = """ + "" "" + ТекущаяДата() + Символы.ПС);";
					ПодстрокаЗамены = """ + "" "" + ТекущаяДата() + Символы.ПС));";
					ТестовыйКод = СтрЗаменить(ТестовыйКод, ПодстрокаПоиска, ПодстрокаЗамены);
					
					// Добавим учет ошибок тестового кода из за синтаксиса и других случаев.
					Голова = "Попытка
						|
						|";
					Хвост = "
						|Исключение
						|	ИнформацияОбОшибке1 = ИнформацияОбОшибке();
						|	Ошибка = ""{" + Заголовок + " Модуль "" + ИнформацияОбОшибке1.ИмяМодуля + "" / Ошибка в строке: "" + ИнформацияОбОшибке1.НомерСтроки  + "" / "" + ИнформацияОбОшибке1.Описание + ""}"";
						|	ТФ.ДобавитьВесьТекст(Новый Файл(ТекущийСценарий().Источник).Путь + ""\LogTUI.txt"", Ошибка + Символы.ПС);
						|КонецПопытки;
						|";
						
					
					ПодстрокаПоиска = "ПодключитьВнешнююКомпоненту";
					ПодстрокаЗамены = Голова + "
					|
					|
					|ПодключитьВнешнююКомпоненту";
					ТестовыйКод = СтрЗаменить(ТестовыйКод, ПодстрокаПоиска, ПодстрокаЗамены);
						
					// ТестовыйКод = Голова + ТестовыйКод + Хвост;
					ТестовыйКод = ТестовыйКод + Хвост;
					
					ТекстДокХХХ = Новый ТекстовыйДокумент;
					
					ИмяВременногоФайла = КаталогТестов + СтрЗаменить(ВыбранныеФайлы[А].Имя, ".html", "") + "-код.os";
					ИмяВременногоФайла = СтрЗаменить(ИмяВременногоФайла, "OSTGui.", "");
					ТекстДокХХХ.Записать(ИмяВременногоФайла, "UTF-8");
					
					// Если Не Ф.ПлатформаWin Тогда
						// ПодстрокаПоиска = "C:\444\111\OneScriptForms\OneScriptForms\bin\Debug\OneScriptForms.dll";
						// ПодстрокаЗамены = "/home/vlad/Projects/444/111/OneScriptForms/OneScriptForms/bin/Debug/OneScriptForms.dll";
						// ТестовыйКод = СтрЗаменить(ТестовыйКод, ПодстрокаПоиска, ПодстрокаЗамены);
					// КонецЕсли;
					
					// Если Не Ф.ПлатформаWin Тогда
						// ПодстрокаПоиска = "ПолучитьИмяВременногоФайла()";
						// ПодстрокаЗамены = """/home/vlad/Projects/444/gnftsu3o.6rb""";
						// ТестовыйКод = СтрЗаменить(ТестовыйКод, ПодстрокаПоиска, ПодстрокаЗамены);
					// КонецЕсли;
					
					ТекстДокХХХ.Прочитать(ИмяВременногоФайла);
					ТекстДокХХХ.УстановитьТекст(ТестовыйКод);
					ТекстДокХХХ.Записать(ИмяВременногоФайла, "UTF-8");
					Форма1.Фокус();
					// Ф.ПередатьУправление();
					Если (Не Ф.ПлатформаWin) Тогда
						// // // // // Команда1("oscript", ИмяВременногоФайла, ПолеВвода1, ВыбранныеФайлы[А].Имя, ТестовыйКод);
					Иначе
						// ЗапуститьПриложение(<СтрокаКоманды>, <ТекущийКаталог>, <ДождатьсяЗавершения>, <КодВозврата>) 
						КодВозврата = Неопределено;
						ЗапуститьПриложение("" + ИмяВременногоФайла + "", , Истина, КодВозврата); // работает
						Если КодВозврата = 1 Тогда
							КаталогНаДиске = Новый Файл(ИмяЛогФайла);
							Если Не (КаталогНаДиске.Существует()) Тогда
								Возврат;
							КонецЕсли;
							ТекстДок = Новый ТекстовыйДокумент;
							ТекстДок.Прочитать(ИмяЛогФайла, "UTF-8");
							СтрЛог = ТекстДок.ПолучитьТекст();
							СтрЛог = СтрЛог + "{" + ИмяВременногоФайла + "}";
							ТекстДок.УстановитьТекст(СтрЛог);
							ТекстДок.Записать(ИмяЛогФайла);
						Иначе // КодВозврата = 1
							// Сообщить("=====" + КодВозврата);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры//ТестированиеКодов

Процедура АнализЛогФайла()
	КаталогНаДиске = Новый Файл(ИмяЛогФайла);
    Если Не (КаталогНаДиске.Существует()) Тогда
		Возврат;
	КонецЕсли;
	ТекстДок = Новый ТекстовыйДокумент;
	ТекстДок.Прочитать(ИмяЛогФайла, "UTF-8");
	Стр = ТекстДок.ПолучитьТекст();
	КолСтрок = СтрЧислоСтрок(Стр);
	Для А = 1 По КолСтрок Цикл
		ТекСтрока = СтрПолучитьСтроку(Стр, А);
		Если (СтрНайти(ТекСтрока, "!!!") > 0) или (СтрНайти(ТекСтрока, "{") > 0) Тогда
			СписокОшибок.Добавить(ТекСтрока);
		КонецЕсли;
	КонецЦикла;
	// Ф.ПередатьУправление();
КонецПроцедуры//АнализЛогФайла

Таймер = ТекущаяУниверсальнаяДатаВМиллисекундах();

// // // Попытка
	КаталогСправки = "C:\444\OneScriptTerminalGui\docs\OSTGui";// без слэша в конце
	КаталогБиблиотеки = "C:\444\111\OneScriptTerminalGui\OneScriptTerminalGui\bin\Debug";// без слэша в конце
	КаталогТестов = "C:\444\ТестыTUI\"; // со слэшем в конце
	ИмяЛогФайла = "C:\444\ТестыTUI\LogTUI.txt";
	ПодключитьВнешнююКомпоненту(КаталогБиблиотеки + "\OneScriptTerminalGui.dll");
// // // Исключение
	// // // // КаталогСправки = "/home/vlad/Projects/444";// без слэша
	// // // // КаталогБиблиотеки = "/home/vlad/Projects/444/111/OneScriptForms/OneScriptForms/bin/Debug";// без слэша
	// // // // КаталогТестов = "/home/vlad/Projects/444/Тесты/"; // со слэшем в конце
	// // // // ИмяВременногоФайла = "/home/vlad/Projects/444/gnftsu3o.6rb";
	// // // // ПодключитьВнешнююКомпоненту(КаталогБиблиотеки + "/OneScriptForms.dll");
// // // КонецПопытки;
ПодключитьВнешнююКомпоненту("C:\444\111\OneScriptForms\OneScriptForms\bin\Debug\OneScriptForms.dll");
Ф = Новый ФормыДляОдноСкрипта();

Если Ф.ПлатформаWin Тогда
	УдалитьФайлы(КаталогТестов, "*.os");
	УдалитьФайлы(ИмяЛогФайла);
Иначе
	// УдалитьФайлы("/home/vlad/Projects/444/ТестыTUI", "*.os");
КонецЕсли;

ТекстДок = Новый ТекстовыйДокумент;
ТекстДок.УстановитьТекст("");
ТекстДок.Записать(ИмяЛогФайла);


Форма1 = Ф.Форма();
Форма1.Текст = "Общий тест OneScriptTerminalGui.dll";
Форма1.Ширина = 1100;
Форма1.Высота = 600;
Форма1.Отображать = Истина;
Форма1.Показать();

ПолеВвода1 = Форма1.ЭлементыУправления.Добавить(Ф.ПолеВвода());
ПолеВвода1.МногострочныйРежим = Истина;
ПолеВвода1.Стыковка = Ф.СтильСтыковки.Заполнение;
ПолеВвода1.ЦветФона = Ф.Цвет().Черный;
ПолеВвода1.ОсновнойЦвет = Ф.Цвет().БледноЗеленый;
ПолеВвода1.ПолосыПрокрутки = Ф.ПолосыПрокрутки.Обе;
ПолеВвода1.ПринятиеВозврат = Истина;
ПолеВвода1.Перенос = Ложь;
ПолеВвода1.РегистрСимволов = Ф.РегистрСимволов.Стандартный;

СписокОшибок = Новый СписокЗначений;

ТестированиеКодов();
АнализЛогФайла();

ПолеВвода1.ДобавитьТекст("================" + Символы.ПС);
ПолеВвода1.ДобавитьТекст("Тест выполнен за: " + ((ТекущаяУниверсальнаяДатаВМиллисекундах()-Таймер)/1000)/60 + " мин." + " " + ТекущаяДата() + Символы.ПС);
ПолеВвода1.ДобавитьТекст("Ошибок = " + СписокОшибок.Количество() + Символы.ПС);
Для А = 0 По СписокОшибок.Количество() - 1 Цикл
	ПолеВвода1.ДобавитьТекст("" + СписокОшибок.Получить(А).Значение + Символы.ПС);
	ПолеВвода1.НачалоВыделения = ПолеВвода1.ДлинаТекста;
	ПолеВвода1.ПрокрутитьДоКурсора();
КонецЦикла;

Ф.ЗапуститьОбработкуСобытий();